Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.RoomNotUpperBoundedByElement Property
 [Family] is not upper bounded by a roof, ceiling or floor element. This can result in incorrect adjacencies and voids in the analytical model. Please ensure that Upper Limit and Limit Offset for [Room] is set correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomNotUpperBoundedByElement { get; }
Visual Basic
Public Shared ReadOnly Property RoomNotUpperBoundedByElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomNotUpperBoundedByElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace